TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
  if ((sensor_flags & SENSOR_FLAG_SPS30) != 0U)
  {
    uplink_port = TX_PORT_ENV_FULL;
  }
  else if ((sensor_flags & SENSOR_FLAG_CO2) != 0U)
  {
    uplink_port = TX_PORT_ENV_EXTENDED;
  }

  /* Wire format by port, all fields are 2-byte big-endian values:
   * - fPort 2: T, RH, P, VBAT, UV
   * - fPort 3: fPort2 + CO2
   * - fPort 4: fPort3 + PM mass + PM number + typ_size
   */
  append_i16_be(AppDataBuffer, &bufferSize, sensor_data.temperature);
  append_u16_be(AppDataBuffer, &bufferSize, sensor_data.humidity);
  append_u16_be(AppDataBuffer, &bufferSize, sensor_data.pressure);
  append_u16_be(AppDataBuffer, &bufferSize, sensor_data.battery_voltage);
  append_u16_be(AppDataBuffer, &bufferSize, sensor_data.uvi_x100);

  if ((sensor_flags & SENSOR_FLAG_CO2) != 0U)
  {
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.co2_ppm);
  }

  if (sensor_flags & SENSOR_FLAG_SPS30)
  {
    uint32_t current_time_s = SysTimeGet().Seconds;
    bool cleaning_triggered = false;

    if (((current_time_s - last_sps30_clean_timestamp) > (SPS30_FAN_CLEAN_INTERVAL_HOURS * 3600U)) &&
        (sensor_data.battery_voltage > 4120))
    {
      APP_LOG(TS_OFF, VLEVEL_M, "Manual SPS30 fan cleaning (VBat=%u mV)\r\n", (unsigned)sensor_data.battery_voltage);
      if (SPS30_StartFanCleaning() == SPS30_STATUS_OK)
      {
        last_sps30_clean_timestamp = current_time_s;
        UTIL_TIMER_Start(&Sps30CleanupTimer);
        cleaning_triggered = true;
      } else
      {
        APP_LOG(TS_OFF, VLEVEL_M, "Failed to start SPS30 fan cleaning\r\n");
      }
    }

    if (!cleaning_triggered)
    {
      (void)SPS30_StopMeasurement();
      (void)SPS30_Sleep();
    }
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.pm1_0);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.pm2_5);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.pm4_0);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.pm10_0);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.nc_0_5);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.nc_1_0);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.nc_2_5);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.nc_4_0);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.nc_10_0);
    append_u16_be(AppDataBuffer, &bufferSize, sensor_data.typ_size);
  }

  APP_LOG(TS_ON, VLEVEL_M, "Uplink payload: fPort=%u, %u bytes\r\n", (unsigned)uplink_port, (unsigned)bufferSize);

  // if (JoinLedTimer.IsRunning)
  // {
  //   UTIL_TIMER_Stop(&JoinLedTimer);
  //   HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  // }

  ASSERT_SMTC_MODEM_RC(smtc_modem_request_uplink(STACK_ID, uplink_port, false, AppDataBuffer, bufferSize));

  if (EventType == TX_ON_TIMER)
  {
    smtc_modem_status_mask_t status_mask = 0;
    smtc_modem_get_status(STACK_ID, &status_mask);
    uint32_t dutycycle = (CertMode || ((status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED)) ? CERT_TX_DUTYCYCLE : tx_dutycycle_s;

    if (sensor_data.battery_voltage < LOW_BATTERY_THRESHOLD_MV)
    {
      dutycycle = dutycycle * 2U; // Reduce TX frequency when battery is low
      APP_LOG(TS_ON, VLEVEL_M, "Low battery (%u mV), reducing TX frequency\r\n", (unsigned)sensor_data.battery_voltage);
    }
    if (sensor_data.battery_voltage < ULTRA_LOW_BATTERY_THRESHOLD_MV)
    {
      dutycycle = dutycycle * 6U;
      tx_counter = 0U;
      APP_LOG(TS_ON, VLEVEL_M, "ULTRA low battery (%u mV), reducing TX frequency only basic measurements\r\n", (unsigned)sensor_data.battery_voltage);
    }

    ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_start_timer(dutycycle));

    /* Schedule pre-measurement only for the next cycle where data is needed */
    uint8_t next_counter = (tx_counter % 10U) + 1U;

    if (next_counter % 5U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Scd41Timer, (dutycycle * 1000U) - SCD41_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Scd41Timer);
      UTIL_TIMER_SetPeriod(&Scd41RestartTimer, (dutycycle * 1000U) - SCD41_RESTART_TIME_MS);
      UTIL_TIMER_Start(&Scd41RestartTimer);
    }

    if (next_counter % 10U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Sps30Timer, (dutycycle * 1000U) - SPS30_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Sps30Timer);
    }
  }
  /* USER CODE END SendTxData_1 */
}

static void processRxData(const uint8_t *payload, uint8_t size, const smtc_modem_dl_metadata_t *metadata)
{
  if ((payload == NULL) || (metadata == NULL))
  {
    APP_LOG(TS_ON, VLEVEL_M, "Ignoring downlink: invalid arguments\r\n");
    return;
  }

  if (size == 0U)
  {
    APP_LOG(TS_ON, VLEVEL_M, "Ignoring downlink: payload size is zero\r\n");
    return;
  }

  if (metadata->fport != RX_CMD_PORT)
  {
    APP_LOG(TS_ON, VLEVEL_M, "Ignoring downlink command on unexpected port %u\r\n", metadata->fport);
    return;
  }

  const uint8_t command = payload[0];
  APP_LOG(TS_ON, VLEVEL_M, "Received command 0x%02X (size=%u, port=%u)\r\n",
          (unsigned)command,
          (unsigned)size,
          metadata->fport);

  switch (command)
  {
    case RX_CMD_TRIGGER_SPS30_CLEANING:
    {
      bool measurement_started = false;
      bool cleaning_started = false;

      APP_LOG(TS_ON, VLEVEL_M, "Message: Trigger SPS30 fan cleaning\r\n");

      if (SPS30_AcquireBus() != SPS30_STATUS_OK)
      {
        APP_LOG(TS_ON, VLEVEL_M, "SPS30 bus acquire failed\r\n");
        break;
      }

      if (SPS30_WakeUp() != SPS30_STATUS_OK)
      {
        (void)SPS30_ReleaseBus();
        APP_LOG(TS_ON, VLEVEL_M, "SPS30 wake-up failed\r\n");
        break;
      }

      if (SPS30_StartMeasurement() == SPS30_STATUS_OK)
      {
        measurement_started = true;
        HAL_Delay(50);
      }
      else
      {
        APP_LOG(TS_ON, VLEVEL_M, "SPS30 start measurement failed\r\n");
      }

      if (measurement_started && (SPS30_StartFanCleaning() == SPS30_STATUS_OK))
      {
        UTIL_TIMER_Start(&Sps30CleanupTimer);
        cleaning_started = true;
        last_sps30_clean_timestamp = SysTimeGet().Seconds;
        APP_LOG(TS_ON, VLEVEL_M, "SPS30 fan cleaning started\r\n");
      }
      else if (measurement_started)
      {
        APP_LOG(TS_ON, VLEVEL_M, "SPS30 fan cleaning start failed\r\n");
      }

      if ((cleaning_started == false) && (measurement_started == true))
      {
        (void)SPS30_StopMeasurement();
        (void)SPS30_Sleep();
      }

