TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
      (void)SPS30_ReleaseBus();

      break;
    }
    case RX_CMD_SET_TX_INTERVAL:
    {
      if (size < 3U)
      {
        APP_LOG(TS_ON, VLEVEL_M, "SET_TX_INTERVAL: payload too short (size=%u)\r\n", (unsigned)size);
        break;
      }

      uint16_t new_interval = (uint16_t)(((uint16_t)payload[1] << 8) | (uint16_t)payload[2]);

      if ((new_interval < APP_TX_DUTYCYCLE_MIN_S) || (new_interval > APP_TX_DUTYCYCLE_MAX_S))
      {
        APP_LOG(TS_ON, VLEVEL_M, "SET_TX_INTERVAL: %u s out of range [%u..%u], ignored\r\n",
                (unsigned)new_interval, (unsigned)APP_TX_DUTYCYCLE_MIN_S, (unsigned)APP_TX_DUTYCYCLE_MAX_S);
        break;
      }

      tx_dutycycle_s = new_interval;
      if (AppConfig_SaveTxDutycycle(tx_dutycycle_s))
      {
        APP_LOG(TS_ON, VLEVEL_M, "SET_TX_INTERVAL: TX interval set to %u s (saved)\r\n", (unsigned)tx_dutycycle_s);
      }
      else
      {
        APP_LOG(TS_ON, VLEVEL_M, "SET_TX_INTERVAL: TX interval set to %u s (flash save FAILED)\r\n", (unsigned)tx_dutycycle_s);
      }
      break;
    }
    case RX_CMD_SOFTWARE_RESET:
      APP_LOG(TS_ON, VLEVEL_M, "Message: Trigger software reset\r\n");
      HAL_NVIC_SystemReset();
      break;
    default:
      APP_LOG(TS_ON, VLEVEL_M, "Message: Unknown command 0x%02X\r\n", (unsigned)command);
      break;
  }
}


/* USER CODE BEGIN PrFD_LedEvents */
/*static bool IsAllZero(const uint8_t *buffer, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    if (buffer[i] != 0U)
    {
      return false;
    }
  }

  return true;
}*/

//static void OnTxTimerLedEvent(void *context)
//{
  // HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
//}

//static void OnRxTimerLedEvent(void *context)
//{
  //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
//}

//static void OnJoinTimerLedEvent(void *context)
//{
  // HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
//}

static void OnScd41TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SCD41 pre-measurement started (stabilisation shot)\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_CO2);
}

static void OnScd41RestartTimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SCD41 stabilisation shot discarded, useful shot started\r\n");
  EnvSensors_RestartPreMeasurement(SENSOR_FLAG_CO2);
}

static void OnSps30TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_SPS30);
}

static void OnSps30CleanupTimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 cleaning finished, going to sleep\r\n");
  (void)SPS30_StopMeasurement();
  (void)SPS30_Sleep();
}

static void ChargerSafetyTimerReset(void)
{
  BQ25185_ChargeDisable();
  UTIL_TIMER_Start(&ChargerCeTimer);
}

static void OnChargerCeTimerEvent(void *context)
{
  BQ25185_ChargeEnable();
}

static void OnChargerSafetyTimerEvent(void *context)
{
  ChargerSafetyTimerReset();
}

static void AppConfig_Load(void)
{
  app_config_t cfg = { 0 };

  if (FLASH_IF_Read(&cfg, (const void *)APP_CONFIG_FLASH_ADDRESS, sizeof(cfg)) != FLASH_IF_OK)
  {
    APP_LOG(TS_OFF, VLEVEL_M, "AppConfig: flash read failed, using default TX interval %u s\r\n",
            (unsigned)tx_dutycycle_s);
    return;
  }

  if ((cfg.magic == APP_CONFIG_MAGIC) &&
      (cfg.tx_dutycycle_s >= APP_TX_DUTYCYCLE_MIN_S) &&
      (cfg.tx_dutycycle_s <= APP_TX_DUTYCYCLE_MAX_S))
  {
    tx_dutycycle_s = cfg.tx_dutycycle_s;
    APP_LOG(TS_OFF, VLEVEL_M, "AppConfig: loaded TX interval %u s from flash\r\n", (unsigned)tx_dutycycle_s);
  }
  else
  {
    APP_LOG(TS_OFF, VLEVEL_M, "AppConfig: no valid config, using default TX interval %u s\r\n",
            (unsigned)tx_dutycycle_s);
  }
}

static bool AppConfig_SaveTxDutycycle(uint32_t dutycycle_s)
{
  app_config_t cfg;
  cfg.magic          = APP_CONFIG_MAGIC;
  cfg.tx_dutycycle_s = dutycycle_s;

  return (FLASH_IF_Write((void *)APP_CONFIG_FLASH_ADDRESS, (const void *)&cfg, sizeof(cfg)) == FLASH_IF_OK);
}

/* USER CODE END PrFD_LedEvents */

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static void OnSleepTimerEvent(void *context)
{
  /* USER CODE BEGIN OnSleepTimerEvent_1 */

  /* USER CODE END OnSleepTimerEvent_1 */
  APP_LOG(TS_ON, VLEVEL_H, "Sleep timer\r\n");

  /* USER CODE BEGIN OnSleepTimerEvent_Last */

  /* USER CODE END OnSleepTimerEvent_Last */
}
#endif /*(LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */

/* --- EOF ------------------------------------------------------------------ */
